package main

import "fmt"

func main() {
	a := [4]int{1, 2, 3, 4}
	reverse(&a)
	fmt.Println(a)
}

func reverse(arr *[4]int) {
	for index, value := range *arr {  // важно проходить по дереференсу массива, а не по самому массиву
		(*arr)[len(arr) - 1 - index] = value  // [4 3 2 1]  // дереференс названия массива при использовании его индексов нужно производить внутри скобок
	}
	/*
	Что происходит:
	- range сразу считывает значение по указателю, делает копию массива и проходит уже только по этой виртуальной копии, независимо от того, что происходит с исходным массивом.
	- С помощью формулы значения элементов подставляются в индексы, которые заполняются в обратном порядке: *arr[3] = 1, *arr[2] = 2, *arr[1] = 3, *arr[0] = 4.
	Альтернативная версия (проход до середины массива и попарный обмен значениями):
	func reverse(arr *[4]int) {
        for i := 0; i < len(arr)/2; i++ {
            j := len(arr) - 1 - i  // та же самая формула
            (*arr)[i], (*arr)[j] = (*arr)[j], (*arr)[i]  // попарный обмен
        }
    }
	*/
}

func notMain() {
	a := 5
	/*
	pointerA := &a  // тип *int - указатель на целочисленную переменную
	fmt.Println(pointerA)  // 0xc00008c060 - адрес выделенной под переменную ячейки памяти
	// для того, чтобы получить значение из указателя (dereference), нужно поставить звёздочку к указателю:
	fmt.Println(*pointerA)  // 5
	*/

	double(&a)  // при такой работе с указателем происходит работа не с переменной, а со значением в памяти, поэтому оно меняется вне зависимости от сохранения в переменную
	fmt.Println(a)  // 10

	/*
	Нельзя пытаться разыменовать nil-указатель. Программа упадёт с паникой из-за рантайма, и выйдет ошибка:
	panic: runtime error: invalid memory address or nil pointer dereference
	
	Поэтому следует проверять левые указатели:
	var ptr *int  // Сейчас он nil

    if ptr != nil {
        fmt.Println(*ptr)  // Сюда мы зайдем, только если адрес есть
	} else {
        fmt.Println("Указатель пустой! Идти некуда.")
	}
	*/
}

func double(num *int) {  // если убирать return, то нужно убрать и тип возврата из объявления функции
	*num *= 2
}
